PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_enet.c
/****************************************************************************
 * drivers/net/kinetis_enet.c
 *
 *   Copyright (C) 2011 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#if defined(CONFIG_NET) && defined(CONFIG_KINETIS_ENET)

#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <time.h>
#include <string.h>
#include <debug.h>
#include <wdog.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mii.h>

#include <net/uip/uip.h>
#include <net/uip/uip-arp.h>
#include <net/uip/uip-arch.h>

#include "up_arch.h"
#include "chip.h"
#include "kinetis_internal.h"
#include "kinetis_config.h"
#include "kinetis_pinmux.h"
#include "kinetis_sim.h"
#include "kinetis_mpu.h"
#include "kinetis_enet.h"

#if defined(KINETIS_NENET) && KINETIS_NENET > 0

/****************************************************************************
 * Definitions
 ****************************************************************************/

/* CONFIG_ENET_NETHIFS determines the number of physical interfaces
 * that will be supported.
 */

#if CONFIG_ENET_NETHIFS != 1
#  error "CONFIG_ENET_NETHIFS must be one for now"
#endif

#if CONFIG_ENET_NTXBUFFERS < 1
#  error "Need at least one TX buffer"
#endif

#if CONFIG_ENET_NRXBUFFERS < 1
#  error "Need at least one RX buffer"
#endif

#define NENET_NBUFFERS (CONFIG_ENET_NTXBUFFERS+CONFIG_ENET_NRXBUFFERS)

#ifndef CONFIG_NET_MULTIBUFFER
#  errror "CONFIG_NET_MULTIBUFFER is required in the configuration"
#endif

/* TX poll delay = 1 seconds. CLK_TCK is the number of clock ticks per second */

#define KINETIS_WDDELAY   (1*CLK_TCK)
#define KINETIS_POLLHSEC  (1*2)

/* TX timeout = 1 minute */

#define KINETIS_TXTIMEOUT (60*CLK_TCK)
#define MII_MAXPOLLS      (0x1ffff)
#define LINK_WAITUS       (500*1000)

/* PHY hardware specifics.  This was copied from the FreeScale code examples.
 * this is a vendor specific register and bit settings.  I really should
 * do the research and find out what this really is.
 */

#define PHY_STATUS         (0x1f)
#define PHY_DUPLEX_STATUS  (4 << 2)
#define PHY_SPEED_STATUS   (1 << 2)

/* Estimate the hold time to use based on the peripheral (bus) clock:
 *
 *   HOLD_TIME = (2*BUS_FREQ_MHZ)/5 + 1
 *             = (BUS_FREQ)/2500000 + 1
 *
 * For example, if BUS_FREQ_MHZ=48 (MHz):
 *
 *   HOLD_TIME = 48Mhz, hold time clocks
 *             = 48000000/2500000 + 1
 *             = 20
 */

#define KINETIS_MII_SPEED  (BOARD_BUS_FREQ/2500000 + 1)
#if KINETIS_MII_SPEED > 63
#  error "KINETIS_MII_SPEED is out-of-range"
#endif

/* Interrupt groups */

#define RX_INTERRUPTS     (ENET_INT_RXF | ENET_INT_RXB)
#define TX_INTERRUPTS      ENET_INT_TXF
#define ERROR_INTERRUPTS  (ENET_INT_UN    | ENET_INT_RL   | ENET_INT_LC | \
                           ENET_INT_EBERR | ENET_INT_BABT | ENET_INT_BABR)

/* This is a helper pointer for accessing the contents of the Ethernet header */

#define BUF ((struct uip_eth_hdr *)priv->dev.d_buf)

/****************************************************************************
 * Private Types
 ****************************************************************************/
/* EMAC statistics (debug only) */

#if defined(CONFIG_DEBUG) && defined(CONFIG_DEBUG_NET)
struct kinetis_statistics_s
{
  uint32_t rx_packets;     /* Number of packets received */
  uint32_t tx_packets;     /* Number of Tx packets queued */
  unit32_t tx_done;        /* Number of packets completed */
  uint32_t tx_timeouts;    /* Number of Tx timeout errors */
  uint32_t errors;         /* Number of error interrupts */
};
#  define EMAC_STAT(priv,name) priv->stats.name++
#else
#  define EMAC_STAT(priv,name)
#endif

/* The kinetis_driver_s encapsulates all state information for a single hardware
 * interface
 */

struct kinetis_driver_s
{
  bool bifup;                  /* true:ifup false:ifdown */
  uint8_t txtail;              /* The oldest busy TX descriptor */
  uint8_t txhead;              /* The next TX descriptor to use */
  uint8_t rxtail;              /* The next RX descriptor to use */
  WDOG_ID txpoll;              /* TX poll timer */
  WDOG_ID txtimeout;           /* TX timeout timer */
  struct enet_desc_s *txdesc;  /* A pointer to the list of TX descriptor */
  struct enet_desc_s *rxdesc;  /* A pointer to the list of RX descriptors */

  /* This holds the information visible to uIP/NuttX */

