PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_enet.c
  struct uip_driver_s dev;     /* Interface understood by uIP */

  /* Statistics */

#if defined(CONFIG_DEBUG) && defined(CONFIG_DEBUG_NET)
  struct kinetis_statistics_s stats;
#endif

  /* The DMA descriptors.  A unaligned uint8_t is used to allocate the
   * memory; 16 is added to assure that we can meet the desciptor alignment
   * requirements.
   */

 uint8_t desc[NENET_NBUFFERS * sizeof(struct enet_desc_s) + 16];

  /* The DMA buffers.  Again, A unaligned uint8_t is used to allocate the
   * memory; 16 is added to assure that we can meet the desciptor alignment
   * requirements.
   */

  uint8_t buffers[NENET_NBUFFERS * CONFIG_NET_BUFSIZE + 16];
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct kinetis_driver_s g_enet[CONFIG_ENET_NETHIFS];

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/
/* Utility functions */

#ifdef CONFIG_ENDIAN_BIG
#  define kinesis_swap32(value) (value)
#  define kinesis_swap16(value) (value)
#else
static inline uint32_t kinesis_swap32(uint32_t value);
static inline uint16_t kinesis_swap16(uint16_t value);
#endif

/* Common TX logic */

static bool kinetics_txringfull(FAR struct kinetis_driver_s *priv);
static int  kinetis_transmit(FAR struct kinetis_driver_s *priv);
static int  kinetis_uiptxpoll(struct uip_driver_s *dev);

/* Interrupt handling */

static void kinetis_receive(FAR struct kinetis_driver_s *priv);
static void kinetis_txdone(FAR struct kinetis_driver_s *priv);
static int  kinetis_interrupt(int irq, FAR void *context);

/* Watchdog timer expirations */

static void kinetis_polltimer(int argc, uint32_t arg, ...);
static void kinetis_txtimeout(int argc, uint32_t arg, ...);

/* NuttX callback functions */

static int kinetis_ifup(struct uip_driver_s *dev);
static int kinetis_ifdown(struct uip_driver_s *dev);
static int kinetis_txavail(struct uip_driver_s *dev);
#ifdef CONFIG_NET_IGMP
static int kinetis_addmac(struct uip_driver_s *dev, FAR const uint8_t *mac);
static int kinetis_rmmac(struct uip_driver_s *dev, FAR const uint8_t *mac);
#endif

/* PHY/MII support */

static inline void kinetis_initmii(struct kinetis_driver_s *priv);
static inline void kinetis_initphy(struct kinetis_driver_s *priv);

/* Initialization */

static void kinetis_initbuffers(struct kinetis_driver_s *priv);
static void kinetis_reset(struct kinetis_driver_s *priv);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Function: kinetis_swap16/32
 *
 * Description:
 *   The descriptors are represented by structures  Unfortunately, when the
 *   structures are overlayed on the data, the bytes are reversed because
 *   the underlying hardware writes the data in big-endian byte order.
 *
 * Parameters:
 *   value  - The value to be byte swapped
 *
 * Returned Value:
 *   The byte swapped value
 *
 ****************************************************************************/

#ifndef CONFIG_ENDIAN_BIG
static inline uint32_t kinesis_swap32(uint32_t value)
{
  uint32_t result = 0;

  __asm__ __volatile__
  (
    "rev %0, %1"
    :"=r" (result)
    : "r"(value)
  );
  return result;
}

static inline uint16_t kinesis_swap16(uint16_t value)
{
  uint16_t result = 0;

  __asm__ __volatile__
  (
    "revsh %0, %1"
    :"=r" (result)
    : "r"(value)
  );
  return result;
}
#endif

/****************************************************************************
 * Function: kinetics_txringfull
 *
 * Description:
 *   Check if all of the TX descriptors are in use.
 *
 * Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   true is the TX ring is full; false if there are free slots at the
 *   head index.
 *
 ****************************************************************************/

static bool kinetics_txringfull(FAR struct kinetis_driver_s *priv)
{
  uint8_t txnext;

  /* Check if there is room in the hardware to hold another outgoing
   * packet.  The ring is full if incrementing the head pointer would
   * collide with the tail pointer.
   */

  txnext = priv->txhead + 1;
  if (txnext > CONFIG_ENET_NTXBUFFERS)
    {
      txnext = 0;
    }

  return priv->txtail == txnext;
}

/****************************************************************************
 * Function: kinetis_transmit
 *
 * Description:
 *   Start hardware transmission.  Called either from the txdone interrupt
 *   handling or from watchdog based polling.
 *
 * Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   May or may not be called from an interrupt handler.  In either case,
 *   global interrupts are disabled, either explicitly or indirectly through
 *   interrupt handling logic.
 *
 ****************************************************************************/

static int kinetis_transmit(FAR struct kinetis_driver_s *priv)
{
  struct enet_desc_s *txdesc;
  uint32_t regval;

  /* When we get here the TX descriptor should show that the previous
   * transfer has  completed.  If we get here, then we are committed to
   * sending a packet; Higher level logic must have assured that there is
   * no transmission in progress.
   */

  txdesc = &priv->txdesc[priv->txhead];
  priv->txhead++;
  if (priv->txhead > CONFIG_ENET_NTXBUFFERS)
    {
      priv->txhead = 0;
    }

  DEBUGASSERT(priv->txtail != priv->txhead &&
             (txdesc->status1 & TXDESC_R) == 0);

  /* Increment statistics */

  EMAC_STAT(priv, tx_packets);

  /* Setup the buffer descriptor for transmission: address=priv->dev.d_buf,
   * length=priv->dev.d_len
   */

  txdesc->length  = kinesis_swap16(priv->dev.d_len);
#ifdef CONFIG_ENET_ENHANCEDBD
  txdesc->bdu     = 0x00000000;
  txdesc->status2 = TXDESC_INT | TXDESC_TS; // | TXDESC_IINS | TXDESC_PINS;
#endif
  txdesc->status1 = (TXDESC_R | TXDESC_L | TXDESC_TC | TXDESC_W);

